app/controllers/pages_controller.rb

  def permalink
    @page = Page.find_by(permalink: params[:permalink])
---
SELECT "pages".* FROM "pages" WHERE "pages"."permalink" = ? LIMIT ?  [["permalink", "about"], ["LIMIT", 1]]