app/controllers/products_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?)  [["id", 2], ["id", 3], ["id", 1]]
SELECT "pages".* FROM "pages"
SELECT "products".* FROM "products" WHERE (created_at >) LIMIT ?  [["LIMIT", 11]]
SELECT COUNT(*) FROM "products"
---
  def index
    @products = Product.includes(:categories).all.paginate(page: params[:page], per_page: 10)

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" INNER JOIN "product_categories" ON "product_categories"."category_id" = "categories"."id" INNER JOIN "products" ON "products"."id" = "product_categories"."product_id" WHERE "products"."id" = ?  [["id", 1]]
SELECT "products".* FROM "products" INNER JOIN "product_categories" ON "product_categories"."product_id" = "products"."id" INNER JOIN "categories" ON "categories"."id" = "product_categories"."category_id" WHERE "products"."id" = ? GROUP BY "category_id" LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @product = Product.find(params[:id])
    @categories = Category.joins(:products)
                          .where(products: { id: params[:id] })

SELECT COUNT(*) FROM "products" WHERE (name LIKE '%%' OR description LIKE '%%')
---
  def search
    keyword = "%#{params[:keywords]}%"

    @products = Product.where('name LIKE ?', keyword)
                       .or(Product.where('description LIKE ?', keyword))
                       .paginate(page: params[:page], per_page: 10)

SELECT "products".* FROM "products" WHERE (updated_at between '2021-11-30' and '2021-12-03') LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products" WHERE (updated_at between '2021-11-30' and '2021-12-03')
---
  def filter
    today = Date.today
    three_days = Date.today - 3

    @recently_posted = Product.where('created_at between ? and ?', three_days, today)
                              .paginate(page: params[:page], per_page: 10)