app/views/products/search.html.erb

<h3 class="subtitle is-5 mt-5 mb-2">
  Found <%= pluralize(@products.count, 'Product')%>
---
SELECT COUNT(*) FROM "products" WHERE (name LIKE '%%' OR description LIKE '%%')